{
    "2025-01-27": {
        "en": [
            "Moritz Fiebig improved by 23 ranking points with a 10th place for his MMM team at the WZA'25.",
            "Verena Evelyn Reimers and Caroline Müller-Korn have slipped down the rankings as their previous WZA'24 points have been dropped; Verena took part in UAE Storm Games 2025 but missed the ranking points (up to 5th place) by one place.",
            "Multiple German athletes participated in the WZA'25 elite divisions but could not secure ranking points (up to 15th place)."
        ],
        "updated": [
            "UAE Storm Games 2025",
            "Wodapalooza Miami 2025"
        ]
    },
    "2025-02-18": {
        "en": [
            "Moritz Fiebig placed 3rd at Picsil Showdown 2025."
        ],
        "updated": [
            "Picsil Showdown 2025"
        ]
    },
    "2025-05-12": {
        "en": [
            "Jan A. Finkenberg finshed as runner-up the Eurasia Throwdown 2025.",
            "Verena Evelyn Reimers placed 10th at the Athens Throwdown 2025.",
            "Moritz Fiebig qualified for the CF Games as runner-up at the in-person semifinal Wodland Fest 2025. Julia Jakobsen placed 11th and Lenn Postel placed 14th.",
            "Moritz Fiebig takes the crown in the French Throwdown Elite Men's division, while Jan A. Finkenberg (6th) and Eric Zuchold (8th) also crack the top 10. Katharina Isele finishes 26th, and Karl Feldmer lands in 35th in the Elite divisions. In the Teams competition, Jana Geertz clinches silver with Team Kaos, while Felix Rheder and Julia Jakobsen score 4th with Team FLÆK. Team Better Protein (Sarah A. Ziemens, Christina Petersen, Noel Nagel, Robert Dopke) secure 8th place, and The Nice Guys 2 (Caroline Müller-Korn, Lidia Bartoszewicz, Benjamin Huxol, Anton Quiring) finish 16th."
        ],
        "updated": [
            "Eurasia Throwdown 2025",
            "Athens Throwdown 2025",
            "Wodland Fest 2025",
            "French Throwdown 2025",
            "World Fitness Tour 1"
        ]
    },
    "2025-07-06": {
        "en": [
            "Jan Arnd Finkenberg defended his 1st place at the Bohemnian Throwdown from 2024 to 2025 - Max Hinköfer and Susan Treppner each placed 3rd.",
            "Battle of the Lion 2025 saw Julia Jakobsen (1st), Jana Geertz (2nd), Pia Zeller (3rd), Anna Bittner (4th), Katharina Blank (5th) and in the male division Jan Arnd Finkenberg (1st), Julius Kieser (2nd), Karl Feldmer (3rd), Oskar Günther (4th), Tobias Becker (5th).",
            "Maja Laloš placed 2nd at the Alsace Throwdown 2025.",
            "The Deutsche Meisterschaft 2025 was won by Julia Jakobsen and Benjamin Huxol, and runner-ups were Vivien-Marie Christian and Eric Zuchold. It follows Jana Geertz (3rd), Franziska Bröhl (4th), Lidia Barto (5th), and Karl Feldmer (3rd), Lenn Postel (4th), and Max Hinköfer (5th)." 
        ],
        "updated": [
            "Bohemian Throwdown 2025",
            "Battle of the Lion 2025",
            "Varna Throwdown 2025",
            "Alsace Throwdown 2025",
            "Turku Tuomiopäivä 2025",
            "UBL Italian Championship 2025",
            "Deutsche Meisterschaft 2025"
        ]
    },
    "2025-08-31": {
        "en": [
            "Anja Keller entered the ranking with a 3rd place at the Strength in Depth 2025.",
            "Moritz Fiebig had a rough start at the CrossFit Games 2025 but finished strong to place 19th overall.",
            "Benjamin Huxol won the Liege TD; Lidia Barto was runner-up, and Susan Treppner and Tobias Beckerplaced 3rd.",
            "Malte Golldack-Bosen and Marc Nowatzke won the Battle the Beach 2025 MM division; Max Hinköfer won the MF division with Nadine Kirchner (AT).",
            "Julius Kieser finished 29th at the WFP Tour Event 2 in Mesa, Arizona."
        ],
        "updated": [
            "Strength in Depth 2025",
            "CISM Regional Military Championships 2025",
            "Marseille Throwdown 2025",
            "CrossFit Games 2025",
            "Liege Throwdown 2025",
            "Battle the Beach 2025",
            "World Fitness Tour 2 in Mesa 2025"
        ]
    }
}